ov8a/system/forceCoeffsIncompressible
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
-------------------------------------------------------------------------------
Description
    Calculates lift, drag and moment coefficients by summing forces on
    specified patches for a case where the solver is incompressible; i.e.,
    pressure is kinematic and has units of m^2/s^2.

\*---------------------------------------------------------------------------*/

#includeEtc "caseDicts/postProcessing/forces/forceCoeffsIncompressible.cfg"

#include    "$FOAM_CASE/0/U"

patches     (".*(cylinder)"); // Patches on which to calculate forces

magUInf     1.0;        // Far field velocity magnitude; e.g., 20 m/s
lRef        1.0;        // Reference length scale for moment calculations;
                        // e.g., 1 m
Aref        1.0;        // Reference area; e.g., 1 m^2

CofR        (0 0 0);    // Centre of rotation; e.g., (0 0 0)

liftDir     (0 1 0);        // Direction of lift force; e.g., (0 0 1)
dragDir     (1 0 0);        // Direction of drag force; e.g., (1 0 0)
pitchAxis   (0 0 1);        // Pitch axis; e.g., (0 1 0)
	//// Dump to file
	log false;
        writeControl   timeStep;
        writeInterval  1;


// ************************************************************************* //
