ov8a/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |				
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9                                   	
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    //default         Euler;
    //default         backward;
    default         CrankNicolson 0.5;
}

gradSchemes
{
    //default         Gauss linear;
    //grad(p)         Gauss linear;

    //default 	     cellLimited Gauss linear 1;
    default 	     cellLimited leastSquares 1;

    //default 	     cellMDLimited leastSquares 0.5;
    //default 	     cellMDLimited Gauss linear 1;

    //grad(U) 	     cellMDLimited Gauss linear 1;
}

divSchemes
{
    default         none;
    //div(phi,U)      Gauss linear;
    //div(phi,U)      Gauss limitedLinearV 1;
    //div(phi,U)      Gauss linearUpwindV default;
    div(phi,U)      Gauss linearUpwind default;
    //div(phi,U)      Gauss linearUpwind grad(U);

    //div(phi,U)      Gauss upwind;

    div((nuEff*dev2(T(grad(U)))))	Gauss linear;
}

laplacianSchemes
{
    default         Gauss linear limited 1;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default         limited 1;
}

// ************************************************************************* //
